{
  "executive_summary": "The Core School maintains a stable sentiment and volume of mentions, with opportunities to expand its program offerings and collaborations. However, it faces high competition in Madrid and lacks international recognition.",
  "key_findings": [
    "The Core School's sentiment is stable, indicating a consistent perception in the market.",
    "The school faces high competition in Madrid, with a share of voice of 11.5%, trailing behind CES and ECAM.",
    "The perception of The Core School is positive, but it lacks international recognition compared to competitors."
  ],
  "opportunities": [
    {
      "opportunity": "Expandir la oferta de programas en escritura de guiones y producción audiovisual práctica.",
      "impact": "Alto"
    },
    {
      "opportunity": "Expandir colaboraciones con empresas del sector audiovisual para mejorar la inserción laboral de los estudiantes.",
      "impact": "Alto"
    }
  ],
  "risks": [
    {
      "risk": "Alta competencia de otras escuelas especializadas en cine y producción audiovisual en Madrid.",
      "mitigation": "Diferenciarse a través de programas únicos y colaboraciones estratégicas."
    },
    {
      "risk": "Falta de reconocimiento internacional comparado con instituciones como EICTV.",
      "mitigation": "Desarrollar alianzas internacionales y programas de intercambio."
    }
  ],
  "recommendations": [
    "Expandir la oferta de programas en áreas de alta demanda.",
    "Fortalecer las colaboraciones con empresas del sector para mejorar la empleabilidad de los estudiantes.",
    "Desarrollar estrategias de marketing para mejorar el reconocimiento internacional."
  ],
  "time_series_analysis": {
    "global": {
      "trend": "estable",
      "anomalies": [
        {
          "date": "2025-09-15",
          "type": "spike",
          "metric": "mentions",
          "note": "Increased visibility likely due to a specific event or announcement."
        },
        {
          "date": "2025-09-26",
          "type": "spike",
          "metric": "mentions",
          "note": "Another peak in mentions, possibly due to a campaign or news."
        }
      ],
      "sentiment_vs_volume": "The sentiment remains stable despite spikes in volume, indicating consistent perception."
    },
    "by_category": [
      {
        "category": "Curriculum & Programs",
        "trend": "estable",
        "anomalies": [],
        "sentiment_vs_volume": "Sentiment is stable, suggesting that curriculum changes are not affecting perception."
      }
    ]
  }
}